nce3-1/L18.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-20 Mon 21:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org9232404" class="outline-2">
<h2 id="org9232404">Lesson 18 Electric currents in modern art</h2>
<div class="outline-text-2" id="text-org9232404">
<p class="verse">
How might some of the exhibits have been dangerous?<br />
<br />
Modern sculpture <b>rarely</b> surprises us <b>any more</b>.<br />
<b>The idea that</b> modern art can only be seen in museums <b>is mistaken</b>.<br />
Even people who <b>take no interest in</b> art<br />
&#xa0;&#xa0;cannot have failed to notice examples of modern sculpture on display in public places.<br />
Strange forms stand in gardens, outside buildings and shops.<br />
We have got quite used to them.<br />
Some so called 'modern' pieces have been on display for nearly eighty years.<br />
<br />
In spite of this,<br />
&#xa0;some people -including myself- were surprised by a recent exhibition of modern sculpture.<br />
The first thing I saw when I entered the art gallery was a notice which said:<br />
&#xa0;&#xa0;'Do not touch the exhibits. Some of them are dangerous!'<br />
The objects on display were pieces of moving sculpture.<br />
Oddly shaped forms that are suspended from the ceiling and move <b>in response to</b> a gust of wind<br />
&#xa0;<b>are quite familiar to</b> everybody.<br />
These objects, however, were different.<br />
Lined up against the wall, there were long thin wires <b>attached to</b> metal spheres.<br />
The spheres had been magnetized and attracted or repelled each other all the time.<br />
In the centre of the hall, there were a number of tall structures which contained coloured lights.<br />
These lights flicker continuously like traffic lights which have <b>gone mad</b>.<br />
Sparks were emitted from small black boxes and red lamps flashed <b>on and off</b> angrily.<br />
<b>It was rather like</b> an exhibition of prehistoric electronic equipment.<br />
These peculiar forms not only <b>seemed designed to shock</b> people emotionally,<br />
&#xa0;but to give them electric shocks as well.<br />
</p>
</div>

<div id="outline-container-orgcc0a5c0" class="outline-3">
<h3 id="orgcc0a5c0">words</h3>
<div class="outline-text-3" id="text-orgcc0a5c0">
<p>
current [ˈkʌrənt] n. 电流<br />
sculpture [ˈskʌlptʃə] n. 雕塑<br />
mistaken [miˈsteɪk] adj. 错误的<br />
gallery [ˈɡæləri] n. 美术馆<br />
exhibit [ɪɡˈzɪbɪt] n. 展品，陈列品<br />
oddly [ˈɑdli] adv. 古怪的<br />
attach [əˈtætʃ] v. 连，系<br />
sphere [sfɪr] n. 球体<br />
magnetize [ˈmæɡnəˌtaɪz] v. 使磁化<br />
repel [rɪˈpel] v. 排斥<br />
flicker [ˈflɪkər] v. 闪烁<br />
emit [ɪˈmɪt] v. 放射<br />
flash [flæʃ]/ v. 闪光<br />
prehistoric [ˌpriˈhɪstɔrɪk] adj. 史前的，老掉牙的<br />
electronic [ˌilekˈtrɑnɪk] adj. 电子的<br />
peculiar [pɪˈkjuljər] adj. 奇异的<br />
shock [ʃɑk] v. 令人震惊，刺激人<br />
emotionally [ɪˈmoʃənlɪ] adv. 感情上<br />
</p>
</div>
</div>

<div id="outline-container-org6c85e2f" class="outline-3">
<h3 id="org6c85e2f">单词造句</h3>
<div class="outline-text-3" id="text-org6c85e2f">
<p>
current n.  electric currents<br />
sculpture n.  make/create a sculpture<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
mistaken adj.  be mistaken about sth./sb.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
gallery n.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
exhibit n.v. exhibition n.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
oddly adv.  Oddly enough, + &#x2026;<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
attach v.  be attached to sb./sth. = attach a. to b.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
sphere n.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
magnetize v.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
repel v.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
flicker v.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
emit v.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
flash v.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
prehistoric adj.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
electronic adj.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
peculiar adj.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
shock v.n.  get/receive an electric shock  give you electric shocks<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
emotionally adv.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>

<div id="outline-container-orgdd21987" class="outline-3">
<h3 id="orgdd21987">反复听电影片段直到懂关键句</h3>
</div>
<div id="outline-container-org8927ca9" class="outline-3">
<h3 id="org8927ca9">复习二册语法(笔记或视频) &amp; 红皮书</h3>
</div>
<div id="outline-container-org5aab5c2" class="outline-3">
<h3 id="org5aab5c2">习惯用法造句</h3>
<div class="outline-text-3" id="text-org5aab5c2">
<p>
not any more = not any longer = no longer<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
The idea that + &#x2026; is mistaken<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
take no/ a great/an interest in<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
in response to<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
be/sound/look/seem familiar to sb.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
go mad<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
on and off<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
It was rather like &#x2026;<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
seemed adj.(designed)  &#x2026;<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
be designed to do sth.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-orgbb846f6" class="outline-3">
<h3 id="orgbb846f6">跟读 50遍</h3>
</div>
<div id="outline-container-orge21906d" class="outline-3">
<h3 id="orge21906d">Comprehension 反复练习</h3>
</div>
<div id="outline-container-org06edd95" class="outline-3">
<h3 id="org06edd95">Ask me if 写+读</h3>
</div>
<div id="outline-container-org6d884f7" class="outline-3">
<h3 id="org6d884f7">摘要写作 写 &amp; 对答案</h3>
</div>
<div id="outline-container-org38b3270" class="outline-3">
<h3 id="org38b3270">tell the story 口语复述</h3>
</div>
<div id="outline-container-orgca96806" class="outline-3">
<h3 id="orgca96806">composition 阅读 或 写作</h3>
</div>
<div id="outline-container-org5b2cb5a" class="outline-3">
<h3 id="org5b2cb5a">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
